<h1><span style="text-decoration: underline;"><span style="font-size: large;"><strong>GREP</strong></span></span></h1>
<p>grep [ -[[AB] ]num ] [ -[CEFGVBchilnsvwx] ] [ -e ] sablon<br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; | -fnume-scenariu ] [ lista_fisiere&nbsp; ]<br /> <br /> <br /> Grep - cauta un anumit sir de caractere intr-un fisier sau in mai multe fisiere si afiseaza la iesirea standard rezultatul.<br /> <br /> Optiuni:<br /> <br /> -c (count) - afiseaza numai numarul de linii care se potrivesc cu sablonul<br /> -h (hide)&nbsp; - nu afiseaza numele fisierului<br /> -i (ignore case) - nu face diferenta intre litere mari si litere mici la<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; cautare<br /> -l&nbsp; - afiseaza numai numele de fisiere care contin sirul cautat (nu si<br /> &nbsp;&nbsp; &nbsp;liniile din aceste fisiere)<br /> -n&nbsp; - afiseaza liniile care se potrivesc sablonului precedate de numarul de<br /> &nbsp;&nbsp; &nbsp;ordine relativ la inceputul fiecarui fisier<br /> -s&nbsp; - nu afiseaza nimic, se foloseste atunci cand ne intereseaza daca s-a<br /> &nbsp;&nbsp; &nbsp;gasit sau nu cel putin o potrivire, intoarce 0 - daca a gasit<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1 - daca nu a gasit<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2 - eroare<br /> -v - afiseaza liniile care nu contin sirul dat<br /> -w - afiseaza liniile in care sirul cautat este un cuvant intreg<br /> -e - se foloseste daca vrem ca sablonul sa inceapa cu "-"<br /> <br /> <br /> Sablonul este o expresie regulara.<br /> <br /> Expresie regulara:<br /> <br /> Expresia regulara este o secventa de caractere in care unele caractere au seminficatie speciala. Cu caracterul "\" se evita semnificatia speciala a unui caracter, "..." evita orice caracter mai putin $ si '...'&nbsp; iar cu '...' se evita orice caracter.<br /> <br /> Caractere cu semnificatie speciala:<br /> <br /> 1) "." - orice caracter<br /> 2) [sir_caractere] - orice caracter din sirul de caractere<br /> &nbsp;&nbsp; [c1 - c2] - orice caracter cuprins intre caracterele c1 si c2 in ordine<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;lexicografica<br /> &nbsp;&nbsp; [^ sir_caractere] - negatia lui [sir_caractere]<br /> 3) "^" - daca e primul caracter din sablon semnifica inceput de linie<br /> &nbsp;&nbsp;&nbsp;&nbsp; ex : $grep ^if fis1 fis2<br /> &nbsp;&nbsp; &nbsp;afiseaza liniile din fis1 si fis2 care incep cu if<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; $grep if fis1 fis2<br /> &nbsp;&nbsp; &nbsp;afiseaza toate liniile din fis1 si fis2 care contin secventa "if"<br /> 4) "$" - daca e ultimul caracter din sablon semnifica sfarsit de linie<br /> &nbsp;&nbsp;&nbsp;&nbsp; ex : $grep fi$ fis1 fis2<br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; afiseaza liniile din fis1 si fis2 care se termina cu fi<br /> 5) \&lt; - semnifica inceput de cuvant (un cuvat este format din litere, cifre<br /> &nbsp;&nbsp; &nbsp;sau -, orice alt caracter este considerat separator)<br /> 6) \&gt; - semnifica sfarsit de cuvant<br /> 7) * - repeta caracterul anterior interpretat ca expresie regulara de<br /> &nbsp;&nbsp; &nbsp;oricate ori&nbsp;&nbsp; &nbsp;<br /> 8) \{n\} - unde n este un numar intre 0 si 255<br /> &nbsp;&nbsp; &nbsp;repeta expresia anterioara de exact n ori<br /> 9) \{n,\} - repeta expresia regulara anterioara de cel putin n ori<br /> 10)\{n,m\} - repeta expresia regulara anterioara de cel putin n ori si de<br /> &nbsp;&nbsp; &nbsp;cel mult m ori<br /> 11)\( expr-regulara\) &lt;=&gt; expr-regulara<br /> 12)\n - unde n este intre 0 si 512<br /> &nbsp;&nbsp; &nbsp;\n inlocuieste un sir cu care s-a inlocuit cea de-a n-a expresie<br /> &nbsp;&nbsp; &nbsp;regulara aflata intre paranteze<br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ex: grep '^\(.*\) \(.*\) \1$' fis1<br /> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; afiseaza toate liniile care incep si se termina cu acelasi cuvat<br /> &nbsp;&nbsp; &nbsp;&nbsp; separtor fiind&nbsp; spatiu si contin mai mult de doua cuvinte<br /> <br /> Exemple:<br /> <br /> ls -l | grep .r..r..r..<br /> <br /> afiseaza toate fisierele si directoarele din directorul curent pentru care exista drepturi de citire (r = read) pentru toate cele trei categorii de utilizatori.<br /> <br /><span class="example1"> grep \&lt;ana\&gt; date.txt</span><br /> <br /> afiseaza liniile de forma<br /> ana are mere<br /> dar nu afiseaza liniile de forma:<br /> maria are o banana</p>
<p>&nbsp;</p>
<h1><span style="text-decoration: underline; font-size: large;"><strong>SED</strong></span></h1>
<p><br /> &nbsp; sed [-n] [-g] [-e scenariu ] [-f fisier_scenariu ] [ lista_fisiere ] ...<br /> <br /> Sed prelucreaza fisiere interpretate text conform unui scenariu sed. Prelucreaza linie cu linie folosind un buffer temporar si afiseaza bufferul temporar la iesirea standard (daca nu se foloseste optiunea -n).<br /> <br /> Un scenariu sed este format din linii de forma<br /> &nbsp;&nbsp; &nbsp;<br /> &nbsp;&nbsp; &nbsp;conditie instructiune<br /> &nbsp;<br /> Conditii:<br /> 1) conditie vida - adevarata pentru toate liniile din fisier<br /> 2) un numar n - adevarata pentru linia cu numarul de ordine egal cu n<br /> (liniile se numeroteaza cumulat in lista de fisiere)<br /> 3) $ - conditie adevarata pentru ultima linie din fisier<br /> 4) /expresie regulara/ - conditie adevarata pentru linile care contin cel<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;putin un subsir care se potriveste cu expresia regulara<br /> 5) expr1,expr2 - adevarata pentru liniile aflate intre linia care se<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;potriveste cu expr1 si linia care se potriveste cu expr2<br /> &nbsp;&nbsp; &nbsp;ex:<br /> &nbsp;&nbsp; &nbsp;$sed 1,10 instructiune fis1<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;executa instructiune asupra liniilor de la 1 la 10<br /> &nbsp;&nbsp; &nbsp;$sed 10,$ instructiune fis1 fis2<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;executa instructiune asupra liniilor de la 10 la sfarsitul<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;fisierului obtinut prin concatenarea lui fis1 cu fis2<br /> <br /> Instructiuni:<br /> <br /> 1) p - afiseaza bufferul temporar la iesirea standard<br /> &nbsp;&nbsp; &nbsp;ex:<br /> &nbsp;&nbsp; &nbsp;$sed p fis1<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;afiseaza fiecare linie de doua ori<br /> &nbsp;&nbsp; &nbsp;$sed -n p fis1<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;afiseaza fiecare linie o data<br /> 2) d - sterge zona temporara<br /> 3) i\ - are ca parametru un text (dat pe liniile urmatoare in<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; fisierul scenariu) pe care il afiseaza la iesirea standard<br /> &nbsp;&nbsp; &nbsp;ex:<br /> &nbsp;&nbsp; &nbsp;fis-s:<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;i\<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;ttttt\<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;11111<br /> &nbsp;&nbsp; &nbsp;$sed -f fis-s fis1<br /> 4) a\ - analog cu \i dar afiseaza dupa prelucrarea fiecarie linii<br /> 5) y/sir1/sir2/ - unde sir1 si sir2 au lungimi egale<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;realizeaza o translatare inlocuind caracterele din fisierele<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;de intrare care se gasesc in sir1 cu caracterele<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;corespunzatoare din sir2<br /> 6) s/expresie_regulara/sir/[flaguri] - inocuieste prima aparitie a unui sir<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;care se potriveste cu expresia regulara cu sirul "sir"<br /> &nbsp;&nbsp; &nbsp;flaguri: - daca lipseste se inlocuieste numai prima aparitie<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp; - daca este un numar n intre 1 si 512 se inlocuieste exact<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;a n-a aparietie<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp; - daca este "g" inlocuieste toate aparitiile din linii<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp; - daca este "p" afiseaza buferul tampon la iesire daca s-a<br /> &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;produs vreo modificare in linia respectiva<br /> <br /> Exemple:<br /> 1. Se cere sa se elimine toate secventele dintr-un<br /> fisier.<br /> <br /> $sed 's/[0-9][a-z,A-Z][0-9]//g' fis1<br /> <br /> 2. Sa se inlocuiasca ultimul cuvant din fiecare linie cu primul cuvant.<br /> Cuvintele contin doar litere si cifre si sunt separate prin spatiu.<br /> <br /> $sed "s/\(^[a-z,0-9]*\)\(.*\)\( [a-z,0-9]*$\)/\1\2 \1/g" fis1<br /> <br /> obs. parametrii din linia de comanda se refera cu $1, $2, .. $n si se poate<br /> folosi comanda shift.</p>
<p>&nbsp;</p>
<p><span style="text-decoration: underline;"><span style="font-size: large;"><strong>AWK</strong></span></span></p>
<p>Acest utilitar prelucreaz&#259; fi&#351;iere text, select&acirc;nd acele linii din text care satisfac condi&#355;ii impuse de o list&#259; de &#351;abloane (expresii regulare) indicate la apelul utilitarului. Numele lui vine de la cei trei proiectan&#355;i &#351;i implementatori ai lui: A. Aho, P. Wieinberger &#351;i B. Kerninghan.</p>
<p><strong>Sintaxa:</strong></p>
<p>awk [ -f fisier-scenariu ] [ -Fc ] [ scenariu ] [ variabila=valoare ... ][ nume fisiere...]</p>
<p><strong><em>Intrarea</em></strong> &icirc;n awk este constituit&#259; fie din fi&#351;ierul de intrare standard, fie din fi&#351;ierele ale c&#259;ror nume sunt date &icirc;n linia de comand&#259;. <em>Rezultatul</em> filtr&#259;rii prin awk este afi&#351;at la ie&#351;irea standard.</p>
<p><strong><em>Scenariu</em></strong> descrie ac&#355;iunile de filtrare. Este descris prin linii de forma:</p>
<p>conditie { instructiuni}</p>
<p>awk trateaz&#259; pe r&acirc;nd c&acirc;te o linie din fi&#351;ierele de intrare &#351;i pentru fiecare execut&#259; instructiuni atunci c&acirc;nd conditie ia valoarea true. de Dac&#259; conditie lipse&#351;te atunci se execut&#259; instructiuni pentru toate liniile din fi&#351;iere.</p>
<p>conditie - este o expresie logic&#259; construit&#259; cu operatorii din C: ||, &amp;&amp;, !, (). Operanzii pot fi expresii aritmetice, expresii relationale, constante &#351;i variabile. Variabilele nu trebuie (s&#259; fie) declarate, ele se ini&#355;ializeaz&#259; automat, tipul lor deduc&acirc;ndu-se din context. Pentru variabilele de tip &#351;ir de caractere exist&#259; operatorul de concatenare (spatiu) precum &#351;i c&acirc;teva func&#355;ii de lucru cu &#351;iruri. Se pot folosi variabile de tip tablou ale c&#259;ror indici pot s&#259; fie numerici sau &#351;iruri de caractere.</p>
<p>&nbsp;</p>
<p><em>Condi&#355;ii predefinite:</em></p>
<ul>
<li>BEGIN&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; este adevarat&#259; &icirc;nainte de prima linie din primul fi&#351;ier</li>
<li>END&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; este adevarat&#259; dup&#259; ultima linie din ultimul fi&#351;ier</li>
</ul>
<p>&nbsp;</p>
<p><em>Variabile predefinite:</em></p>
<ul>
<li>NF - num&#259;rul de cuvinte din linia curent&#259;</li>
<li>NR - num&#259;rul de ordine al liniei curente (num&#259;r&#259;toarea &icirc;ncepe de la 1); linia cu nr. 1 este prima linie din primul fi&#351;ier</li>
<li>FNR - num&#259;rul de ordine al liniei curente; liniile cu nr. 1 sunt primele linii din fiecare fisier; numaratoare &icirc;ncepe de la 1 la &icirc;nceputul fiec&#259;rui fi&#351;ier</li>
<li>FS - separatorul de c&acirc;mpuri</li>
<li>FILENAME - numele fi&#351;ierului curent care este tratat</li>
<li>OFS&nbsp;&nbsp;&nbsp;&nbsp; - separator de c&acirc;mpuri la ie&#351;ire (implicit este spa&#355;iu)</li>
<li>ORS&nbsp;&nbsp;&nbsp;&nbsp; - separator de &icirc;nregistr&#259;ri la ie&#351;ire (implicit este linie nou&#259;)</li>
<li>ARGV &ndash; &#351;irul parametrilor din linia de comand&#259;</li>
<li>ARGC &ndash; num&#259;rul parametrilor din linia de comand&#259;</li>
</ul>
<p>&nbsp;</p>
<p><em>Accesarea c&acirc;mpurilor:</em></p>
<ul>
<li>se face cu $1, $2 ...$i, $(i+1),&nbsp; $NF, iar &icirc;ntreaga linie se refer&#259; cu $0</li>
</ul>
<p>&nbsp;</p>
<p><em>Func&#355;</em><em>ii predefinite:</em></p>
<ul>
<li>length(sir)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - lungime &#351;ir; length &lt;=&gt; length($0)</li>
<li>substr(s,p,n) - sub&#351;irul lui s care &icirc;ncepe la pozi&#355;ia p &#351;i are lungimea n</li>
<li>index(s1,s2)&nbsp;&nbsp;&nbsp;&nbsp; - &icirc;ntoarce pozi&#355;ia la care s2 apare &icirc;n s1 sau 0 la absen&#355;&#259;</li>
<li>sprintf(format, arg1,..) - &icirc;ntoarce ca rezultat &#351;irul pe care printf l-ar tip&#259;ri &icirc;n C</li>
<li>split(s,a,c) - unde s este &#351;ir, a este tablou &#351;i c un caracter. &Icirc;mparte &#351;irul s &icirc;n c&acirc;mpuri consider&acirc;nd ca separator caracterul c; dac&#259; c lipse&#351;te atunci separatorul implicit este FS. Valorile &icirc;mp&#259;r&#355;ite sunt date ca valori elementelor tabloului a</li>
</ul>
<p>&nbsp;</p>
<p><em>Instruc&#355;</em><em>iuni</em></p>
<ul>
<li>variabil&#259; = exprsie</li>
<li>instruc&#355;iunile if, for, while ca &#351;i &icirc;n C</li>
<li>for (i in numetablou) instruc&#355;iune. - i ia ca valori indicii lui numetablou &#351;i se execut&#259; instruc&#355;iune pentru fiecare valoare a lui i</li>
<li>; este separator de instruc&#355;iuni</li>
<li>} este separator de linie, continuarea unei linii se face cu caracterul \ pe ultima pozi&#355;ie din linie</li>
<li>print list&#259;-expresii [ &gt; nume-fi&#351;] - afi&#351;eaz&#259; la ie&#351;irea standard valoarea expresiilor separate prin OFS, iar la sf&acirc;r&#351;it de linie pune ORS. Dac&#259; exist&#259; &gt;nume-fi&#351; atunci scrierea se face &icirc;n fi&#351;ierul specificat.</li>
</ul>
<p>&nbsp;</p>
<p><em>Exemple:</em></p>
<p>1. S&#259; se afi&#351;eze dintr-un fi&#351;ier primul cuv&acirc;nt din fiecare linie</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; a) f&#259;r&#259; fi&#351;ier scenariu</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; awk '{ print $1}' nume_fis</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; b) cu fi&#351;ier scenariu</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; fis-s : {print $1}</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; awk -f fis-s nume_fis</p>
<p>2. S&#259; se afi&#351;eze dintr-un fi&#351;ier linile mai lungi de 5 caractere, iar afi&#351;area lor s&#259; se fac&#259; &icirc;n ordinea invers&#259; apari&#355;iei lor.</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; a) f&#259;r&#259; fi&#351;ier scenariu</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; awk 'length&gt;5 {x[i++]=$0} \</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; END { for(j=i; j&gt;0 ; j--) print x[j]}' nume_fis</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; b) cu fi&#351;ier scenariu</p>
<p>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;fis-s : length&gt;5 {x[i++]=$0}</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; END { for(j=i; j&gt;0 ; j--) print x[j]}</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; awk -f fis-s nume_fis</p>
<p>&nbsp;</p>
<p><strong><span style="font-size: large;">Probleme propuse</span></strong>:</p>
<h3>grep (se vor rezolva dou&#259; probleme)</h3>
<p>&nbsp;</p>
<ol start="1">
<li>S&#259; se afi&#351;eze con&#355;inutul tuturor fi&#351;ierelor text din directorul dat ca parametru &icirc;n linia de comand&#259; &#351;i din subdirectoarele lui.</li>
</ol><ol start="2">
<li>S&#259; se afi&#351;eze numele fi&#351;ierelor din linia de comand&#259; care con&#355;in un anumit cuv&acirc;nt dat &#351;i el ca parametru &icirc;n linia de comand&#259;. Se cere s&#259; se afi&#351;eze &#351;i num&#259;rul lor.</li>
</ol><ol start="3">
<li>S&#259; se afi&#351;eze numele tuturor fi&#351;ierelor binare din directoarele date ca parametri &icirc;n linia de comand&#259; &#351;i din subdirectoarele acestora.</li>
</ol><ol start="4">
<li>S&#259; se afi&#351;eze numele tuturor utilizatorilor din sistem care fac parte dintr-un anumit grup al c&#259;rui identificator este dat ca parametru &icirc;n linia de comanda. S&#259; se afi&#351;eze &#351;i numele grupului.</li>
</ol><ol start="5">
<li>S&#259; se afi&#351;eze numele tuturor utilizatorilor care execut&#259; o anumit&#259; comanda dat&#259; ca parametru.</li>
</ol><ol start="6">
<li>S&#259; se afi&#351;eze numele tuturor utilizatorilor care s-au conectat la serverul curent &icirc;ntr-o anumita dat&#259; &#351;i de la o anumit&#259; ma&#351;ina date ca parametri &icirc;n linia de comand&#259;.</li>
</ol><ol start="7">
<li>Pentru o list&#259; de servere date ca parametri &icirc;n linia de comand&#259; se cere s&#259; se afi&#351;eze dac&#259; sunt accesibile sau nu. Pentru a se testa dac&#259; un server este accesibil sau nu se poate folosi comanda <em>ping</em>.</li>
</ol><ol start="8">
<li>Pentru anumi&#355;i utilizatori da&#355;i &icirc;n linia de comand&#259; se cere s&#259; se afi&#351;eze dac&#259; au lucrat la o anumit&#259; dat&#259; sau nu.</li>
</ol><ol start="9">
<li>Pentru o anumit&#259; list&#259; de utilizatori, dat&#259; &icirc;n linia de comand&#259;, se cere sa se afiseze dac&#259; lucreaz&#259; sau nu.</li>
</ol><ol start="10">
<li>S&#259; se afiseze pentru fiecare utilizator din linia de comand&#259;, un mesaj indic&acirc;nd dac&#259; este permisa sau nu listarea con&#355;inutului directorului gazd&#259;.</li>
</ol><ol start="11">
<li>S&#259; se afi&#351;eze numele tuturor utilizatorilor da&#355;i ca parametri &icirc;n linia de comand&#259; care nu s-au conectat niciodat&#259; la serverul curent.</li>
</ol><ol start="12">
<li>Pentru o list&#259; de directoare date ca parametri (&#351;i din subdirectoarele acestora) s&#259; se stearg&#259; toate fi&#351;ierele al c&#259;ror nume sunt date &icirc;n fi&#351;ierul date ca prim parametru.</li>
</ol>
<h3>sed (se vor rezolva trei probleme)</h3>
<ol start="1">
<li>Se cere s&#259; se &#351;tearg&#259; toate apari&#355;iile cuvintelor date ca parametri din fi&#351;ierul care este dat ca prim parametru.</li>
</ol><ol start="2">
<li>S&#259; se &#351;tearg&#259; toate liniile din fi&#351;ierele date ca parametri care con&#355;in un anumit text indicat &icirc;ntr-un prim parametru.</li>
</ol><ol start="3">
<li>S&#259; se &#351;tearg&#259; din primele 30 de linii din fi&#351;ierele date ca parametri acelea care con&#355;in textul indicat de primul parametru.</li>
</ol><ol start="4">
<li>S&#259; se adauge &icirc;n fa&#355;a fiecarei litere mici cuv&acirc;ntul indicat ca prim parametru. Fi&#351;ierele tratate sunt ceilal&#355;i parametri din linia de comanda.</li>
</ol><ol start="5">
<li>S&#259; se &#351;tearg&#259; toate cuvintele care con&#355;in cel pu&#355;in o cifr&#259; din fi&#351;erele date ca parametri.</li>
</ol><ol start="6">
<li>S&#259; se &icirc;nlocuiasc&#259; toate caracterele care nu sunt litere mari cu un caracter indicat de primul parametru. Fi&#351;ierele tratate sunt indicate de ceilal&#355;i parametri.</li>
</ol><ol start="7">
<li>S&#259; se &icirc;nlocuiasc&#259; toate vocalele litere mici din fi&#351;ierele date ca parametri cu litere mari corespunzatoare &#351;i viceversa.</li>
</ol><ol start="8">
<li>S&#259; se &icirc;nlocuiasc&#259; al treilea cuv&acirc;nt din fiecare linie cu primul cuv&acirc;nt. Cuvintele sunt separate de &ldquo;:&rdquo; &#351;i con&#355;in doar litere sau cifre.</li>
</ol><ol start="9">
<li>S&#259; se &#351;tearga cuvintele de pe pozi&#355;iile 2 &#351;i 4 din fi&#351;ierele indicate ca parametri. Cuvintele con&#355;in doar litere sau cifre &#351;i sunt despar&#355;ite prin spa&#355;iu.</li>
</ol><ol start="10">
<li>S&#259; se schimbe &icirc;ntre ele cuvintele de pe pozi&#355;iile 1 &#351;i 3 din fi&#351;ierele date ca parametri. Cuvintele con&#355;in doar litere &#351;i sunt separate prin orice alt caracter.</li>
</ol><ol start="11">
<li>S&#259; se converteasc&#259; un fi&#351;ier html &icirc;ntr-un fi&#351;ier text folosind comanda sed (s&#259; se elimine tot con&#355;inutul fi&#351;ierului html aflat &icirc;ntre caracterele &ldquo;&lt;&rdquo; &#351;i &ldquo;&gt;&rdquo;).</li>
</ol><ol start="12">
<li>&nbsp;S&#259; se &icirc;nlocuiasc&#259; &icirc;ntr-un fi&#351;ier text toate apari&#355;iile unor numere formate dintr-o singur&#259; cifr&#259; astfel: numarul format din cifra 1 se va &icirc;nlocui cu cuvantul &ldquo;un&rdquo;, numarul 2 cu cuv&acirc;ntul &ldquo;doi&rdquo;, etc. Num&#259;rul 11 va fi l&#259;sat a&#351;a cum este.</li>
</ol>
<h3>awk (se vor rezolva cel putin 2 probleme)</h3>
<ol start="1">
<li>Sa se calculeze si afiseze login-ul si suma cifrelor din login pentru fiecare utilizator din sistem care are login-ul compus dintr-o combinatie alfanumerica.</li>
</ol><ol start="2">
<li>Sa se afiseze continutul oricitor fisiere, fiecare fisier&nbsp; fiind afisat incepind cu ultima linie, continuind cu cea anterioara acesteia s.a.m.d.</li>
</ol><ol start="3">
<li>Sa se afiseze continutul oricitor fisiere dupa cum urmeaza:primul fisier afisat asa cum este iar fisierul urmator cu cuvintele din linii cuvintele fiind separate de :) scrise in ordine inversa. (Modul de afisare se reia pentru fisierele urmatoare).</li>
</ol><ol start="4">
<li>Sa se afiseze liniile din fisiere care contin un acelasi cuvint aflat in pozitii consecutive. Pentru liniile respective sa se afiseze si numarul &nbsp;liniei precum si cuvantul implicat.(in cadrul fisierului din care face parte).</li>
</ol><ol start="5">
<li>Sa se afiseze din fiecare fisier numerele liniilor care au lungimea cel putin 10. De asemenea sa se afiseze continutul liniilor respective mai putin primele 10 caractere. La terminarea analizei unui anumit fisier se va afisa numele fisierului si numarul de linii care au fost afisate.</li>
</ol><ol start="6">
<li>Sa se afiseze pentru fiecare fisier: numele acestuia, si numarul mediu de cuvinte per linie &nbsp;per fisier (media numarului de cuvinte pentru liniile fisierului). Se va afisa si media numarului de cuvinte pentru toate fisierele luate la un loc.</li>
</ol><ol start="7">
<li>Sa se afiseze pentru oricite fisiere, pentru liniile din acestea care sint mai lungi de 30 de caractere, numarul liniei (din cadrul fisierului), primul cuvint si ultimul.</li>
</ol><ol start="8">
<li>Sa se faca suma tuturor cimpurilor, care reprexinta numere valide, din liniile unui fisier . La terminarea analizei lui sa se afiseze suma obtinuta si raportul dintre numarul de linii care contin numere valide si cele care nu contin deloc numere valide. &nbsp;Aceasta sa se faca pentru oricite fisiere. (Ex: Suma =XXXXXX ContineNr/NuContineNR = 100 / 25)</li>
</ol><ol start="9">
<li>Sa se afiseze numele tuturor fisierelor din linia de comanda care contin propozitii in care se repeta un cuvant mai mult sau egal de doua ori. Se va afisa deasemenea pentru fiecare asemenea caz numarul liniei si cuvantul implicat.(prima sa aparitie in propozitia respectiva)</li>
</ol><ol start="10">
<li>Sa se afiseze numarul de fisiere din linia de comanda a lui awk, numarul total de cuvinte si numarul mediu de cuvinte din fisiere.</li>
</ol><ol start="11">
<li>Sa se afiseze dintr-o lista de fisiere numele acelui fisier care are numar maxim de cuvinte si numarul cuvintelor.</li>
</ol><ol start="12">
<li>Sa se inlocuiasca intr-un numar oarecare de fisiere orice aparitie a unui anumit cuvint cu un alt cuvint; cuvintele respective vor fi date in linia de comanda awk ca si parametri).</li>
</ol><ol start="13">
<li>Sa se afiseze pentru o masina Unix login-ul si numarul utilizatorilor care au fost logati in sistem intr-un interval orar al unei date (acesti parametri vor fi specificati in linia de comanda). (hh:mm-hh:mm 10-oct-2002). Data se poate specifica in orice format. Se va folosi eventual comanda <em>last</em>.</li>
</ol><ol start="14">
<li>Sa se afiseze pentru o masina Linux numarul mediu de utilizatori pentru un interval orar (hh:mm-hh:mm) in decursul unei luni calendaristice. Se va folosi comanda <em>last.</em></li>
</ol><ol start="15">
<li>&nbsp;Sa se afiseze pentru fiecare fisier din linia de comanda raportul dintre numarul de vocale si numarul de consoane.<br /> Ex (file1.txt v/c = 123/12).</li>
</ol>
<p>&nbsp;&nbsp;&nbsp;&nbsp; 16. Sa se afiseze numele fiecarui fisier din linia de comanda care contine propozitii cu mai mult de 30 cuvinte intr-un procent mai mare de 25% (din nr total de propozotii al fisierului). O propozitie este delimitata de caracterele (. ! ? ).</p>
<p>&nbsp;</p>
<h2>problema C</h2>
<p>Sa se scrie un program C care aloca o matrice 3-dimensionala ale carei dimensiuni sunt citite de la tastatura. Matricea se va popula cu valoarea 1 peste tot si apoi se va calcula suma tuturor elementelor. La sfarsit, memoria alocata se va dealoca.</p>
<p>Problema va fi rulata cu valgrind (alocare si dealocare corecta a memoriei , gasirea problemelor de memorie cu valgrind):<br /> &gt; gcc -Wall -pedantic&nbsp; p.c -o p.o<br /> &gt; valgrind ./p.o</p>
<p>&nbsp;</p>